public/signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
            <soapenv:Header/>
            <soapenv:Body><RegisterInvoiceRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="https://efi.tax.gov.me/fs/schema" Id="Request" Version="1">
    <Header SendDateTime="2021-04-27T10:52:52+02:00" UUID="8947f79f-80ee-4cee-ad16-e759393aeeea"/>

    <Invoice TypeOfInv="NONCASH" IsSimplifiedInv="false" IssueDateTime="2021-04-27T10:52:52+02:00" InvNum="xx123xx123/1/2021/si747we971" InvOrdNum="1" TCRCode="si747we971" IsIssuerInVAT="true" TotPriceWoVAT="155.00" TotVATAmt="100.00" TotPrice="255.00" OperatorCode="oo123oo123" BusinUnitCode="xx123xx123" SoftCode="ss123ss123" IIC="e140f1d24671c6b525f428c031b98520" IICSignature="9bfd62b4cd64024d0d2007bdfa115457d56ae967d9931cfde3aff9612d2385d80b6141f3db29ebd638875b79efb7c21ceda90bce847179a07854fec78fe60a8d731889a90039850e60557674f4e44d4ca9ce629baeb44b3daa17126701d89501f86f553df65e396da924c07672252df4488d6755c5a5d7a74ea472234cb3f7d926be8f65e1f6e11ee7f6452c0549ba43668a3687411aae5df0b1b47495a451eaebc5dd2388125c552ef210f1ec764432756cd986019aa74fc2803bcf4c1a5c1c2f1596662dbbb3b96bd78e1b6d09175a14df449cc881601083721800fdcccd26afb4c9e903aa2367fd08f241fd6841ef2a844f7b6a191f812e2c9acbcb2672a5" IsReverseCharge="false">
        <PayMethods>
            <PayMethod Type="ADVANCE" Amt="255.00"/>
        </PayMethods>

        <Seller IDType="TIN" IDNum="12345678" Name="Gross Market Podgorica"/>

        <Buyer IDType="TIN" IDNum="12345678" Name="Dobrija"/>

        <Items>
                            <I N="ipsa" C="0" U="kom" Q="1.00" UPB="155.00" UPA="0.00" R="55.00" RR="1" PB="0.00" VR="0.07" VA="100.00" PA="255.00"/>
                    </Items>

        <SameTaxes>
                                                                            <SameTax NumOfItems="1" PriceBefVAT="155.00" VATRate="7.00" VATAmt="100.00"/>
                                                                </SameTaxes>
    </Invoice>
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
  <SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
    <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
  <Reference URI="#Request"><Transforms><Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/><DigestValue>PSkTdT3SXdFzebd/m6ENEHBvGkC6R/u1S0CEJhNuumw=</DigestValue></Reference></SignedInfo><SignatureValue>qjnNmyhppscGst44SxDd9g2a6sXPeLdY8uOYtOrdYaMKgQnxWiVNULl6A2fGL6UZYzwwdasVWyIAQ69iu4cpeJTpFOWsQDd1XQW08Xf1NJ8zHs1GCOC12f1iirJneODYQpQD3HaOh4n08G6BYYExMB9ZjyVQ6xSnpAl89DmwL7Y7UMlz/dmrVAAnkWZLFKUeHGPkd9MpP2gTZbLgWKN2RLWpwgzLGTh8kbtnDfDN8kMRMkIqjf8wpPfp9LcbXkueY7N7nWHjUBayOshBm2gH7vvenXymPQg3YB4a5mNOxXUYw4RTKxeRKYaQK5w1GbxqyIbmpaTPXwOTLQBDIJfJnw==</SignatureValue>
<KeyInfo><X509Data><X509Certificate>MIIFoDCCBAigAwIBAgIIAosoHBIRrfUwDQYJKoZIhvcNAQELBQAwTzELMAkGA1UE
BhMCTUUxDzANBgNVBAoMBkNvcmVpdDEXMBUGA1UEYQwOVkFUTUUtMDI3NzUwMTgx
FjAUBgNVBAMMDUNvcmVpdCBTdWIgQ0EwHhcNMjAxMDA1MTIxNDQ3WhcNMjMxMDA1
MTIxNDQ3WjCBmzELMAkGA1UEBhMCTUUxGjAYBgNVBAoMEVRlc3QgT25seSBDb21w
YW55MRcwFQYDVQRhDA5WQVRNRS0xMjM0NTY3ODESMBAGA1UECwwJT3BlcmFjaWpl
MQ4wDAYDVQQFEwUxMDAwMTEzMDEGA1UEAwwqVGVzdCBPbmx5IENvbXBhbnkgKFBl
xI1hdC9BdXRlbnRpZmlrYWNpamEpMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIB
CgKCAQEAqzK8vMGchz7qc5K7eqvLy3kMIO7omEv406wLU+vIMIeusmwebrVYCd03
EdMrI6ktDFiUuQbD1Ze0+oxpBLT9iFpB3njTf+z2phI5BNkEseHGxc0BrT8S2DTG
qO13xAYwcqViK6cARfpgzpRB6B1HLVKmW5PwlwNQlmXuM61bQqyaPLrToNex+drV
ybO9r2zLQzY5ztNV5F1Uy/pQnggZt2qRyFO71cW/D7+Vc1d14DGG4gy3TmW36BQK
3zSGBy11psNLLsNDPl14JaqrKZgKv9o6M9+qZ0yb08HHoURkR91XsbJ0YnUZJy+D
jy6rya7iqqN5y5MIc9qfdul7HI/FuQIDAQABo4IBsTCCAa0wDAYDVR0TAQH/BAIw
ADAfBgNVHSMEGDAWgBRS3xfznifJOu61Gx/QkwDS8wtU/jBxBggrBgEFBQcBAQRl
MGMwLwYIKwYBBQUHMAKGI2h0dHA6Ly9jYS5jb3JlaXQubWUvQ29yZWl0U3ViQ0Eu
Y2VyMDAGCCsGAQUFBzABhiRodHRwOi8vb2NzcC5jYS5jb3JlaXQubWUvQ29yZWl0
U3ViQ0EwQgYDVR0gBDswOTA3Bg0rBgEEAYOjKQEBAgIBMCYwJAYIKwYBBQUHAgEW
GGh0dHA6Ly9jYS5jb3JlaXQubWUvY3BzLzBcBggrBgEFBQcBAwRQME4wCAYGBACO
RgEBMBMGBgQAjkYBBjAJBgcEAI5GAQYCMC0GBgQAjkYBBTAjMCEWG2h0dHBzOi8v
Y2EuY29yZWl0Lm1lL3Bkcy9lbhMCZW4wOAYDVR0fBDEwLzAtoCugKYYnaHR0cDov
L2NybC5jYS5jb3JlaXQubWUvQ29yZWl0U3ViQ0EuY3JsMB0GA1UdDgQWBBSLBPEd
crmjuxuatJAJ3dUzJmzzbjAOBgNVHQ8BAf8EBAMCBsAwDQYJKoZIhvcNAQELBQAD
ggGBACp0Yi52FnYapjzVv//lC17uU6EKrIomCs1QUQSQE7zXrz4pBgnB3v4mNS1g
0EzFtzfkIspjQex1Y8D/SdgtFrVmwfmUhsI/GLtr1VvlSVTMdRoekGDHS8J89wna
rebV3pxfIFpmKw3iqQwIQXur5gXCRojPehJoAg3J/YhA1XT6D0aEYJVhRjIuSqee
c/G7XIDKnr8sOy+iOBaHVjvnQ5cYmXgVyslDuWFZ7N5mRrWYreXX+WaOAQf1+zEq
BsRwZp7jAU62dmI4D4C/FqrANhOby6FKOjCylX7VrF3igZyQ+KHVETSxqJXMTyQ9
uBRZ/G+lubDfjGVlcwznQLPpo3VFpExIvS8Ne/5M1KJjBcVhzc2lPC5ObIyu+Tex
IYNvuj2FwRs9xLGAwkO0LMJNfjYPItWhBoHZej3SUScgBGtI6p9n8xFrMly93tAJ
+GhBX4Wncz3TAUhkhH8jPvJUJVYil1QGToOCBIp/XD76BbF67Q/DStDSCeU68CqS
oTQLMw==
</X509Certificate></X509Data></KeyInfo></Signature></RegisterInvoiceRequest>
</soapenv:Body>
            </soapenv:Envelope>